<script setup>
import newcard from '../components/Newcard.vue'
import { ref } from 'vue';

const Box_news=ref([
   {name: 'WHOประกาศ ‘แอสปาร์แตม’ สารให้ความหวานแทนน้ำตาล อาจก่อมะเร็ง แนะนำให้บริโภคอย่างพอประมาณ', 
   img:"https://www.thaihealth.or.th/wp-content/uploads/2023/07/แอสปาร์-Web.jpg",
    data_time:'17 กรกฎาคม 2566'
    }, 

    {name: '“สุขภาพดีไม่มีโรคกินไข่ไก่” ได้วันละ 1 ฟอง ได้รับสารอาหารครบถ้วน ทั้งโปรตีนและไขมัน', 
    img:"https://www.thaihealth.or.th/wp-content/uploads/2023/03/ไข่วันละฟอง-WEB-copy.jpg",
    data_time:'17 มีนาคม 2566'
    },
  
    {name: 'แนะหลีกเลี่ยงเมนู ตับสด – ไม่สุก เสี่ยง ‘ติดเชื้อ – พยาธิ – ไข้หูดับ’', 
    img:"https://www.thaihealth.or.th/wp-content/uploads/2023/01/คอลัมน์-ข่าวสุขภาพ-web-2.jpg",
    data_time:'30 มกราคม 2566'
    },

    {name: 'มูลค้างคาว สาเหตุติดเชื้อราในปอดฮิสโตพลาสโมซิส', 
    img:"https://www.thaihealth.or.th/wp-content/uploads/2023/07/แอสปาร์-Web.jpg",
    data_time:'06 28 ตุลาคม 2565'
    },

    {name: 'งดใช้ ‘ลวด-ลูกแม็กซ์’ ในบรรจุภัณฑ์อาหาร', 
    img:"https://www.thaihealth.or.th/wp-content/uploads/2022/10/ไก่ย่าง-เว็บ.jpg",
    data_time:'28 ตุลาคม 2565'
    },
])
</script>

<template>
        <newcard></newcard>
        <div class="row g-5">
          <div class="col-md-8">
      
            <article class="blog-post">
              <h2 class="display-5 link-body-emphasis mb-1"> 5 เทคนิคลับสำหรับ สายแข็ง! ทำอย่างไรไม่ให้เมาจนเพื่อนล้อ </h2>
              <p class="blog-post-meta">January 1, 2023 </p>
      
              <p>การเข้าสังคมในสมัยนี้ต้องดื่มกันทั้งนั้น ไม่ว่าจะงานปาร์ตี้ วันเกิดเพื่อน วันปีใหม่ วันเพื่อนฝูง วันนู้นวันนี้มีเยอะแยะเต็มไปหมด และยิ่งไปกว่านั้นจะดื่มยังไงให้อยู่นานที่สุดและเมาช้าที่สุดน๊าาาา ^^  </p>
              <hr>
             
              <h2> 1. หลีกเลี่ยงเครื่องดื่มแอลกอฮอลล์ที่มีดีกรีสูง</h2>
              <p>ในบางงานเลี้ยง งานสังสรรค์ จะมีเครื่องดื่มมากกว่า 10 ชนิดให้เราเลือกทาน ซึ่งการเลือกทานนี้แหละที่จะเป็นตัวช่วยให้คุณเมาช้าที่สุด !! หากคุณรู้ตัวว่าคอไม่แข็งมากพอ ควรดื่มเครื่องดื่มประเภท ไวน์&nbsp; หรือ เบียร์ เพราะเครื่องดื่มที่แรงมากๆอย่าง วอดก้า หรือ cocktail เป็นตัวเร่งให้คุณเมาง่ายและหมดสติเร็วสุดๆเลยล่ะจ้า !!</p>
      
              <h3> 2. กินกับข้าวเยอะๆ</h3>
              <p>เหตุผลที่คุณควรกินอาหารเข้าไปเยอะๆในระหว่างทานเครื่องดื่มแอลกอฮอล์ เพราะว่าอาหารจะดูดซึมปริมาณแอลกอฮอล์จากร่างกายโดยตรง และที่ควรทานที่สุดคือของที่มีไขมันสูง เช่น ของทอด ของย่าง เพื่อที่น้ำมันจะได้ไปเคลือบกระเพาะ เทคนิคนี้ไม่จำเป็นต้องกลัวอ้วนแล้วค่ะ เพื่อป้องกันตัวเองและป้องกันไม่ให้เมาเร็วด้วย เทคนิคนี้รับรองว่าเวิร์คค่ะ ^^</p>
      
              <h2> 3. ดื่มน้ำเปล่าเข้าไปเยอะๆ </h2>
              <p>ถ้าคุณรู้ตัวว่าคุณเริ่มจะเมาแล้ว ทางแก้ที่ง่ายที่สุดคือคุณต้องดื่มน้ำเข้าไปให้มากๆ เพราะน้ำจะช่วยล้างสารพิษต่างๆได้เป็นอย่างดี ดื่มแต่น้ำอย่างเดียวจนกว่าคุณจะรู้สึกดีขึ้น จากผลวิจัยชี้แล้วว่า น้ำคือสิ่งที่ช่วยให้คุณสร่างเมาได้เร็วที่สุดนั่นเองจ้า !!</p>
      
              <h2> 4. ไม่ควรดื่มเครื่องดื่มแอลกอฮอล์ผสมกับเครื่องดื่มที่มีน้ำตาลสูง</h2>
              <p>เนื่องจากแอลกอฮอล์ปกติก็มีฤทธิ์ที่ทำให้มึนเมามากพอสมควรอยู่แล้ว และคุณผสมน้ำผลไม้ต่างๆที่มีน้ำตาลสูงอยู่เยอะเข้าไปอีก ทำให้เมาแน่นอนจ้า !! เพราะขณะดื่ม น้ำตาลในเลือดบางส่วนจะถูกเปลี่ยนให้เป็นแอลกอฮอล์ ดังนั้นคุณจะเมาง่ายและมีอาการแฮงค์ทันทีเมื่อคุณตื่นนอน !</p>
      
              <h3> 5. รู้ขีดจำกัดของตัวเอง</h3>
              <p>บางคนที่อาจจะไม่เคยทานมาก่อน อาจจะคิดว่าเมาเป็นยังไง? ไม่เคยเมา? คงไม่เมาง่ายๆหรอก นั่นคือการที่คุณจะไม่สามารถรู้ลิมิตของตัวเองได้เลยและกินแบบกระดกเอาเรื่อยๆไม่หยุด ในเวลาต่อมาคุณน๊อคคาโต๊ะแน่นอนค่ะ !! ดังนั้นหากคุณรู้ว่าตัวเองยังไม่เคยลอง ให้ค่อยๆทานและสังเกตุตัวเองอยู่เสมอ หากพบว่าเริ่มเวียนหัวหรือทุกอย่างรอบตัวเริ่มช้าลง คุณควรดื่มน้ำเปล่ามากๆเพื่อล้างแอลกอฮอล์ในร่างกายค่ะ ^^</p>
            
            </article>
      
            <article class="blog-post">
              
            </article>
      
            <nav class="blog-pagination" aria-label="Pagination">
            </nav>
      
          </div>
      
      
      <!--Side bar-->
          <div class="col-md-4">
            <div class="position-sticky" style="top: 2rem;">
              <div class="p-4 mb-3 bg-body-tertiary rounded">
                <h4 class="fst-italic">About</h4>
                <p class="mb-0">เว็บไซต์ที่รวบรวมร้าน สำหรับสายนักดื่ม หรือ Hang on เที่ยวกับเพื่อนเพลิน ปาร์ตี้อย่างเฮฮา</p>
              </div>
      
              <div>
                <h4 class="fst-italic">Recent posts</h4>
                <ul class="list-unstyled">
                  <li>
                    <a class="d-flex flex-column flex-lg-row gap-3 align-items-start align-items-lg-center py-3 link-body-emphasis text-decoration-none border-top" href="#" v-for="(i,index) in Box_news" :key="index">
                    <svg class="bd-placeholder-img"  xmlns="http://www.w3.org/2000/svg" aria-hidden="true" preserveAspectRatio="xMidYMid slice" focusable="false">
                      <image :xlink:href="i.img" x="0" y="40" width="100px" />
                    </svg>
                      <div class="col-lg-8">
                        <h6 class="mb-0">{{i.name }}</h6>
                        <small class="text-body-secondary">{{i.data_time}}</small>
                      </div>
                    </a>
                  </li>
                </ul>
              </div>
            </div>
          </div>
      
      
      
      </div>
    
</template>
